#### ExternalResourceMatchOptions Members

---

|  |
| --- |
| ExternalResourceMatchOptions Class   Constructors   Methods   Properties   See Also |

The  ExternalResourceMatchOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternalResourceMatchOptions | Constructs new instance with specified resource type. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExternalResourceMatchOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | ResourceType | The desired resource type which external resources should match. |

# See Also

ExternalResourceMatchOptions Class

Autodesk.Revit.DB Namespace